# Chapter 5. 변수와 자료형

print("아 이런젠장 이제되네 !!!")

# greeting이라고 하는 변수 선언과 동시에
# 이 변수에 ㅎㅇ 라는 문자열 값을 할당
# 변수는 데이터를 변경해서 할당할 수 있는 공간이다
greeting = "ㅎㅇ" 
print(greeting)

greeting = "헬로우"
print(greeting)

# -------------< Naming Convention(명명 ☆규칙☆) >---------------
# 1. 변수 사이에 공백이 허용되지 않는다. 
#  ㄴ ex) gree ting = "hello"
# 2. 단어 사이는 _(언더스코어)를 사용하여 연결한다.
#  ㄴ ex) greeting_1 = "world"
# 3. 변수를 선언하기 위한 문자열은 숫자/특수문자로 시작이 불가능하다.
#  ㄴ ex) 1_greeting (x), !_greeting(x)
# 4. 예약어는 변수로 선언이 불가능하다.
#  ㄴ ex) print = "hello"
# 5. 가급적 소문자로 사용
# 6. 오타 주의!
# -----------------------------------------------------------

